sim6/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    Inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          372;
        startFace       520776;
    }
    Outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          688;
        startFace       521148;
    }
    Wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          37568;
        startFace       521836;
    }
)

// ************************************************************************* //
