sim6/constant/physicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}

continuousPhaseName air;

viscosityModel  constant;
nu              nu [0 2 -1 0 0 0 0] 1.5e-05;
rho             rho [1 -3 0 0 0 0 0] 1.2;

air
{
    viscosityModel  constant;
    nu              nu [0 2 -1 0 0 0 0] 1.5e-05;
    rho             rho [1 -3 0 0 0 0 0] 1.2;
    nu.air          nu [0 2 -1 0 0 0 0] 1.5e-05;
    rho.air         rho [1 -3 0 0 0 0 0] 1.2;
}

nu.air          nu [0 2 -1 0 0 0 0] 1.5e-05;
rho.air         rho [1 -3 0 0 0 0 0] 1.2;
